//Тройка Пифагора - три натуральных числа a < b < c, для которых выполняется равенство
//
//a^2 + b^2 = c^2
//Например, 3^2 + 4^2 = 9 + 16 = 25 = 52.
//
//Существует только одна тройка Пифагора, для которой a + b + c = 1000.
//Ответ: 200 375 425

package ProjectEuler;

public class Problem9 {

    //c = 1000 - a - b
    //a^2 + b^2 = a^2 + b^2 + 2*a*b - 2000*a - 2000*b + 10^6
    //a = 1000 * (500 - b) / (1000 - b)

    public static void main(String[] args) {
        for (int b = 1; b < 1000; b++) {
            if (1000 * (500 - b) % (1000 - b) == 0) {
                int a, c;
                a = 1000 * (500 - b) / (1000 - b);
                c = 1000 - a - b;
                System.out.println(a + " " + b + " " + c);
                break;
            }
        }
    }
}
